Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: "C:\Program Files\7-Zip\7z" a -tzip "%outputFile%" "%inputFile%" // шаблоны %inputFile% и %outputFile% при выполнении команды заменяются на значения параметров // «Исходное имя файла запроса» и «Результирующее имя файла запроса» соответственно.
en: "C:\Program Files\7-Zip\7z" a -tzip "%outputFile%" "%inputFile%" // %inputFile% and %outputFile% templates are replaced with the parameters values // "The request file source name" and "The resulting name of the request file", while the command is executed correspondingly.

source: "C:\Program Files\7-Zip\7z" e "%inputFile%" -so > "%outputFile%" // шаблоны %inputFile% и %outputFile% при выполнении команды заменяются на значения параметров // «Исходное имя файла ответа» и «Результирующее имя файла ответа» соответственно.
en: "C:\Program Files\7-Zip\7z" e "%inputFile%" -so > "%outputFile%" // %inputFile% and %outputFile% templates are replaced with the parameters values // "The response file source name" and "The resulting name of the response file", while the command is executed correspondingly.

source: %spoiler%Параметры_loginom в виде КЛЮЧ=значение%spoiler%
en: %spoiler%Loginom_options in the form of KEY=Value%spoiler%

source: %spoiler%Примеры настройки Windows Firewal:%spoiler%
en: %spoiler%Examples of Windows Firewall configuring:%spoiler%

source: %spoiler%Примеры%spoiler%
en: %spoiler%Examples%spoiler%

source: * Документ по умолчанию
en: * Default document

source: * Обзор Каталога
en: * Directory overview

source: * Расширения ISAPI
en: * ISAPI extensions

source: * Расширяемость .NET4.
en: * Extensibility .NET4.

source: * Статическое содержимое
en: *Static content

source: * Фильтрация запросов
en: * Request filtering

source: * Фильтры ISAPI
en: * ISAPI filters

source: - Безопасность (Установлено 1 из 9)
en: - Safety (1 installed of 9)

source: - Общие функции HTTP (Установлено 3 из 6)
en: - General HTTP functions (3 installed of 6)

source: - Разработка приложений (Установлено 4 из 11)
en: - Applications development (4 installed of 11)

source: 1 Гб
en: 1 GB

source: 64-х битная версия Loginom Desktop способна обработать большие массивы данных, ограниченные только ресурсами рабочей станции.
en: The 64-bit Loginom Desktop version can process significant data arrays limited only by workstation resources.

source: 8 Гб
en: 8 GB

source: :: "тихая" установка Loginom без веб-сервера msiexec /i ".\LoginomEnterprise.msi" /qn ADDLOCAL=Server,Studio,Help :: "тихая" установка с нестандартными портами msiexec /i ".\LoginomEnterprise.msi" /qn WEBSRV_PORT=9080 SERVER_WS_PORT=9081 SERVER_PORT=9082 :: "тихая" установка с включением SSL для websocket msiexec /i ".\LoginomEnterprise.msi" /qn SERVER_USE_SSL=1 SERVER_KEY_PATH="%ALLUSERSPROFILE%\ssl.key" SERVER_CRT_PATH="%ALLUSERSPROFILE%\ssl.crt"
en: :: "silent" installation of Loginom without web server msiexec /i ".\LoginomEnterprise.msi" /qn ADDLOCAL=Server,Studio,Help :: "silent" installation with non-standard ports msiexec /i ".\LoginomEnterprise.msi" /qn WEBSRV_PORT=9080 SERVER_WS_PORT=9081 SERVER_PORT=9082 :: "silent" installation with SSL activation for websocket msiexec /i ".\LoginomEnterprise.msi" /qn SERVER_USE_SSL=1 SERVER_KEY_PATH="%ALLUSERSPROFILE%\ssl.key" SERVER_CRT_PATH="%ALLUSERSPROFILE%\ssl.crt"

source: :: Для windows 2008/7/2012/8: dism /online /enable-feature /FeatureName:IIS-ApplicationDevelopment /FeatureName:IIS-ISAPIExtensions /FeatureName:WAS-WindowsActivationService /FeatureName:WAS-ProcessModel /FeatureName:IIS-NetFxExtensibility /FeatureName:WAS-NetFxEnvironment /FeatureName:WAS-ConfigurationAPI /FeatureName:WCF-HTTP-Activation :: Для windows 2012r2/8.1/2016/10: dism /online /enable-feature /FeatureName:IIS-ApplicationDevelopment /FeatureName:IIS-ISAPIExtensions /FeatureName:WAS-WindowsActivationService /FeatureName:WAS-ProcessModel /FeatureName:IIS-ASPNET45 /FeatureName:IIS-NetFxExtensibility45 /FeatureName:NetFx4Extended-ASPNET45 /FeatureName:WCF-Services45 /FeatureName:IIS-ISAPIFilter /FeatureName:WCF-HTTP-Activation45 /all :: Для windows 2008/7/2012/8/2012r2/8.1 регистрируем ASP.NET: "%WinDir%\Microsoft.NET\Framework64\v4.0.30319\Aspnet_regiis.exe" -iru :: Для windows 2008/7/2012/8/2012r2/8.1 разрешаем исполнение модулей ISAPI: "%windir%\system32\inetsrv\appcmd.exe" set config /section:isapiCgiRestriction /[path='%WinDir%\Microsoft.NET\Framework64\v4.0.30319\aspnet_isapi.dll'].allowed:True
en: :: For windows 2008/7/2012/8: dism /online /enable-feature /FeatureName:IIS-ApplicationDevelopment /FeatureName:IIS-ISAPIExtensions /FeatureName:WAS-WindowsActivationService /FeatureName:WAS-ProcessModel /FeatureName:IIS-NetFxExtensibility /FeatureName:WAS-NetFxEnvironment /FeatureName:WAS-ConfigurationAPI /FeatureName:WCF-HTTP-Activation :: For windows 2012r2/8.1/2016/10: dism /online /enable-feature /FeatureName:IIS-ApplicationDevelopment /FeatureName:IIS-ISAPIExtensions /FeatureName:WAS-WindowsActivationService /FeatureName:WAS-ProcessModel /FeatureName:IIS-ASPNET45 /FeatureName:IIS-NetFxExtensibility45 /FeatureName:NetFx4Extended-ASPNET45 /FeatureName:WCF-Services45 /FeatureName:IIS-ISAPIFilter /FeatureName:WCF-HTTP-Activation45 /all ::It is required to register ASP.NET for windows 2008/7/2012/8/2012r2/8.1: "%WinDir%\Microsoft.NET\Framework64\v4.0.30319\Aspnet_regiis.exe" -iru :: It is required to allow execution of ISAPI modules for windows 2008/7/2012/8/2012r2/8.1: "%windir%\system32\inetsrv\appcmd.exe" set config /section:isapiCgiRestriction /[path='%WinDir%\Microsoft.NET\Framework64\v4.0.30319\aspnet_isapi.dll'].allowed:True

source: <wsdl:documentation> В настоящий момент не опубликовано ни одного пакета.
en: <wsdl:documentation> No package published at the present moment.

source: /l* "%TEMP%\loginom.msi.log" — включение журналирования установки.
en: /l* "%TEMP%\loginom.msi.log" — activation of installation logging.

source: /qn — "тихая" установка без отображения графического интерфейса.
en: /qn — "silent" installation without graphic interface mapping.

source: 1. Запустить Мастер активации Guardant (GuardantActivationWizard.exe), установить опцию "Режим offline" (внизу слева) и нажать кнопку "Далее":
en: 1. To run Guardant Activation Wizard (GuardantActivationWizard.exe), to install the "Offline mode" option (at the bottom, leftward) and to press the "Next" button:

source: 1. Останавливаем службу loginom.
en: 1. It is required to stop the loginom service.

source: 1. При помощи кнопки "Указать файл лицензии" выберите путь к файлу вида *.grdvd.
en: 1. Using the "Specify the license file" button, select the path to *.grdvd file.

source: 2. Ввести серийный номер программного ключа.
en: 2. To enter the software dongle serial number.

source: 2. Запускаем инсталлятор Loginom новой версии:
en: 2. Loginom installer (new version) is started:

source: 2. Укажите в поле ввода серийный номер для активации.
en: 2. Enter the serial number in the entry field for activation.

source: 3. Если активация прошла успешно, мастер выдает завершающее диалоговое окно:
en: 3. If activation is a success, the wizard shows the final dialog window:

source: 3. После обновления запускаем службу loginom
en: 3. After the upgrade, it is required to start theloginom service

source: 3. Этот файл необходимо перенести на компьютер, где есть доступ в интернет, запустить Мастер активации (GuardantActivationWizard.exe), нажать кнопку "Указать файл лицензии…" и в выпадающем списке окна навигации указать в поле "Тип файлов:" параметр "Файлы для передачи на сервер активации (*toserver)":
en: 3.It is required to transfer this file to the computer with net access, to run the Activation Wizard (GuardantActivationWizard.exe), to press the "Specify the license file..." button and to specify the "Files for transfer to the activation server (*toserver)" parameter in the drop-down list of the navigation window in the "Files type:" field:

source: 4. Программа соединится с сервером активации и сгенерирует еще один файл, который нужно перенести на компьютер конечного пользователя для завершения активации:
en: 4. The program will connect with the activation server and generate one more file to be transferred to the final user computer to finish the activation process:

source: 5. На компьютере конечного пользователя запустить Мастер активации (GuardantActivationWizard.exe) (Важно: опцию "Режим offline" (внизу слева) не устанавливать), нажать кнопку "Указать файл лицензии" и, в открывшемся диалоге выбора файлов, указав тип файла "Файлы, полученные с сервера активации (*.fromserver)" выбрать нужный файл:
en: 5. It is required to run the Activation Wizard (GuardantActivationWizard.exe) on the final user computer (Important: the "Offline mode" option (at the bottom, leftward) must not be installed), to press the "Specify the license file..." button and to select the required file in the opened file selection dialog having specified the file type "FIles received from the activation server (*.fromserver)":

source: 6. Нажать кнопку "Далее":
en: 6. To press the "Next" button:

source: 7. Процесс активации завершен:
en: 7. The activation process is finished:

source: :appdomain - идентификатор домена приложения;
en: :appdomain - application domain identifier;

source: :date - время события;
en: :date - event time;

source: :exception - текст ошибки;
en: :exception - error text;

source: :level - уровень события;
en: :level - event level;

source: :machinename - NetBIOS имя хоста, на котором запущен Integrator;
en: :machinename - NetBIOS name of the host on which Integrator runs;

source: :message - текст события;
en: :message - event text;

source: :requestid - уникальный идентификатор запроса;
en: :requestid - unique request identifier;

source: :username - имя пользователя, от имени которого запущен процесс Integrator;
en: :username - name of the user on whose behalf the Integrator process was initiated;

source: All - трассировка;
en: All - trace;

source: Apache – стандартная установка, web-сервер входит в состав дистрибутива;
en: Apache – standard installation, web server is included into the distribution kit

source: Bind - IP адрес сетевого интерфейса, используемого сервером Loginom.
en: Bind - the IP address of the network interface used by the Loginom server.

source: ContentType для передачи в заголовке — значение данного параметра передается в заголовке Content-Type пакета сообщения к внешнему сервису.
en: ContentType for transfer in the header — the value of this parameter is transferred in the Content-Type header of the message package to the external service.

source: Error- ошибки;
en: Error- errors;

source: Fatal - критические ошибки;
en: Fatal - fatal errors;

source: IP, Порт — параметры привязки сайта IIS.
en: IP, Port — binding parameters of the IIS site.

source: Info - информация;
en: Info - info;

source: LogFileMaxIndex - максимальное количество файлов журнала.
en: LogFileMaxIndex - the maximum number of the log files.

source: LogFileMaxSize - максимальный размер файла журнала в байтах.
en: LogFileMaxSize - the maximum size of the log file in bytes.

source: LogFileName - имя файла журнала.
en: LogFileName - the log file name.

source: LogFileRewrite - если атрибут установлен, при старте Loginom Server файл журнала будет перезаписан.
en: LogFileRewrite - if the attribute has been set, the log file will be rewritten while the Loginom Server is starting.

source: Loginom Server обязателен для установки сервера Loginom.
en: Loginom Server is compulsory for the Loginom server installation.

source: Loginom Studio устанавливает web-интерфейс.
en: Loginom Studio installs the web interface.

source: Loginom в Яндекс.Облако
en: Loginom in Yandex.Cloud

source: Microsoft IIS – не входит в состав дистрибутива, он должен быть установлен и настроен отдельно.
en: Microsoft IIS is not included in the distribution kit. It must be installed and configured separately.

source: MinLogLevel - минимальный уровень журналирования.
en: MinLogLevel - the minimum logging level.

source: Namespace корневого элемента SOAP запроса.
en: Namespace of the root element of the SOAP request.

source: Namespace корневого элемента SOAP ответа;
en: Namespace of the root element of the SOAP response;

source: Off - журналирование отключено.
en: Off - logging off.

source: Port - номер порта для подключения Loginom Integrator и BatchLauncher.
en: Port - port number for the Loginom Integrator and the BatchLauncher connection.

source: Proxy URI — определяет параметр path.
en: Proxy URI defines the path parameter.

source: SOAPAction для передачи в заголовке — значение данного параметра передается в заголовке SOAPAction HTTP/HTTPS-пакета, передаваемого внешнему сервису.
en: SOAPAction for transfer in the header — the value of this parameter is transferred in the SOAPAction header of the HTTP/HTTPS package transferred to the external service.

source: SSLCertificateFile - полный или относительный (от рабочего каталога) путь к файлу сертификата SSL в формате pem.
en: SSLCertificateFile - a full or relative path (from the working directory) to the SSL certificate file in the pem format.

source: SSLPrivateKeyFile - полный или относительный (от рабочего каталога) путь к файлу ключа SSL в формате pem.
en: SSLPrivateKeyFile - a full or relative path (from the working directory) to the SSL key file in the pem format.

source: SessionBackup - расположение каталога резервных копий сессий.
en: SessionBackup - location of the backup session copies directory.

source: URL веб-приложения
en: URL of the Web Application

source: URL для отправки запроса
en: URL for request sending

source: URL для отправки запроса — адрес веб-сервиса, куда будут отправляться запросы.
en: URL for the request sending — the web service address for requests sending.

source: UserStorage - расположение каталогов пользователей.
en: UserStorage - location of the user directories.

source: WSPort - номер порта для подключения Loginom Studio по протоколу websocket (ws).
en: WSPort - port number for the Loginom Studio connection according to the websocket (ws) protocol.

source: WSSPort - номер порта для подключения Loginom Studio по протоколу websocket secure (wss).
en: WSSPort - port number for the Loginom Studio connection according to the websocket secure (wss) protocol.

source: Warn - предупреждения;
en: Warn - warnings;

source: XML-сообщение подписано сертификатом — принимает значения true, false.
en: Certificate signed XML message — takes true, or false values.

source: XSLT для трансформации входящего сообщения перед передачей — указывается путь к соответствующим файлам xslt-преобразований.
en: XSLT for the incoming message transformation before its transfer — the path to corresponding files of the XSLT transformations is specified.

source: XSLT для трансформации ответного сообщения — указывается путь к соответствующим файлам xslt-преобразований.
en: XSLT for the response message transformation — the path to corresponding files of the XSLT transformations is specified.

source: address - сетевой адрес хоста Loginom Server.
en: address - network address of the Loginom Server host.

source: admin с паролем admin — для администрирования сервера Loginom
en: admin with the admin password — for Loginom server administration

source: appDomainColumn - имя поля для записи идентификатора домена приложения;
en: appDomainColumn - field name for the application domain identifier record;

source: connectionString - строка подключения к базе данных.
en: connectionString - database connection string.

source: database - запись в базу данных;
en: database - database record;

source: dateColumn - имя поля для записи времени;
en: dateColumn - field name for the time record;

source: eventLog - запись в журнал событий Windows;
en: eventLog - Windows event log record;

source: exceptionColumn - имя поля для записи текста ошибки;
en: exceptionColumn - field name for the error text record;

source: fileSystem - запись в файл;
en: fileSystem - file record;

source: internal - запись в файл событий логирования (к примеру, ошибок при записи логов в базу данных).
en: internal - logging events file record (for example, errors while log recording in the database).

source: level - минимальный уровень журналирования.
en: level - minimum logging level.

source: levelColumn - имя поля для записи уровня события;
en: levelColumn - field name for the event level record;

source: llDebug - отладка.
en: llDebug - debug.

source: llError - ошибка.
en: llError - error.

source: llFatal - авария.
en: llFatal - fatal.

source: llHint - событие.
en: llHint - event.

source: llInfo - информация.
en: llInfo - info.

source: llTrace - трассировка.
en: llTrace - trace.

source: llWarn - предупреждение.
en: llWarn - warning.

source: machineNameColumn - имя поля для записи NetBIOS имени хоста, на котором запущен Integrator;
en: machineNameColumn - field name for NetBIOS record of the host name on which Integrator runs;

source: maxArchiveFiles - максимальное количество архивных журналов.
en: maxArchiveFiles - maximum number of archive logs.

source: messageColumn - имя поля для записи текста события;
en: messageColumn - field name for the event text record;

source: password - пароль учетной записи с правом на вход в качестве службы.
en: password - account password with login right as a service.

source: path - полный или относительный (от рабочего каталога) путь к каталогу журналов.
en: path - full or relative (from the working directory) path to the log directory.

source: port - TCP порт сервера.
en: port - TCP server port.

source: requestIdColumn - имя поля для записи уникального идентификатора запроса;
en: requestIdColumn - field name for the unique identifier request record;

source: reserved - атрибут со значением "true" помечает сервер как резервный.
en: reserved - the attribute with the "true" value marks the server as the standby one.

source: service с паролем service — для подключения внешних приложений (Integrator и BatchLauncher)
en: service with the service password — for connection of external applications (Integrator and BatchLauncher)

source: table - имя таблицы;
en: table - table name;

source: targetNamespace в WSDL — значение берется из одноименного атрибута WSDL-описания внешнего сервиса.
en: targetNamespace in WSDL — the value is taken from the similarly-named attribute of the WSDL description of the external service.

source: user с пустым паролем — для работы со сценариями Loginom
en: user with blank password — for work with Loginom workflows

source: userName - имя учетной записи с правом на вход в качестве службы.
en: userName - account name with login right as a service.

source: userNameColumn - имя поля для записи пользователя, от имени которого запущен процесс Integrator;
en: userNameColumn - field name for the user record on whose behalf the Integrator process was initiated;

source: Адаптер представляет собой промежуточный веб-сервис между реализованным в Loginom сценарием и внешними веб-сервисами.
en: The Adapter is an intermediate web service between the workflow executed in Loginom and the external web services.

source: Активация SP-ключа (offline)
en: Activation of SP dongle (offline)

source: Активация SP-ключа (online)
en: Activation of SP dongle (online)

source: ВАЖНО: Размер используемой оперативной памяти (RAM) ограничен 2 GB (ограничение платформы x86).
en: IMPORTANT: The capacity of used RAM is limited by 2 GB (platform limit x86).

source: Важно: Особенностью Guardant SP является криптографическая привязка к оборудованию, т.е. активированный ключ нельзя использовать на другом компьютере.
en: Important: Guardant SP is distinguished by the cryptographic binding to the equipment, namely it is not possible to use the activated dongle on the other computer.

source: Важно: Особенностью программного SP-ключа является криптографическая привязка к оборудованию, т.е. после активаци SP-ключ нельзя повторно автивировать или пренести на другой компьютер.
en: Important: SP dongle is distinguished by the cryptographic binding to the equipment, namely it is not possible to reactivate SP dongle after its activation or transfer it to another computer.

source: Важно: несоответствие результирующего XML-ответа его описанию в XSD-схеме приведет к ошибке в работе с веб-сервисом Адаптера.
en: Important: incompliance of the resulting XML response with its description in the XSD schema will cause the Adapter web service operation error.

source: Варианты исполнения ключа
en: Dongle versions

source: Веб-сервер устанавливает встроенный web-сервер Apache Httpd.
en: The web server installs the embedded Apache Httpd web server.

source: Взаимодействие компонентов
en: Interaction of components

source: Всегда использовать безопасное подключение — включает параметр secure.
en: Always use secure connection activates the secure parameter.

source: Главная
en: Home

source: Диагностика ключей Guardant
en: Guardant dongles diagnostics

source: Документация добавляет в web-интерфейс раздел справки по работе с платформой.
en: The Documentation enables addition of the platform operation reference section to the web interface.

source: Заголовки (Message Headers):
en: Headers (Message Headers):

source: Заголовок входящего сообщения — применяется для БКИ «ОКБ».
en: The incoming message header is used for credit reference bureau "UNITED CREDIT BUREAU".

source: Имя веб-сервиса — уникальное имя веб-сервиса.
en: The web service name — the unique web service name.

source: Имя корневого элемента SOAP запроса, Namespace корневого элемента SOAP запроса — значения этих параметров берутся из XSD-схемы описания запроса.
en: The root element name of the SOAP request, Namespace of the root element of the SOAP request — values of these parameters are taken from the XSD schema of the request description.

source: Имя корневого элемента SOAP запроса;
en: The root element name of the SOAP request;

source: Имя корневого элемента SOAP ответа, Namespace корневого элемента SOAP ответа — значения этих параметров берутся из XSD-схемы описания запроса.
en: The root element name of the SOAP response, Namespace of the root element of the SOAP response — values of these parameters are taken from the XSD schema of the request description.

source: Имя корневого элемента SOAP ответа;
en: The root element name of the SOAP response;

source: Имя метода в Loginom Adapter — используется для формирования имен элементов в WSDL-описании веб-сервиса в случае совпадения значений параметра Имя метода для различных методов конфигурации Адаптера.
en: Method name in Loginom Adapter is used to form the item names in the WSDL description of the web service in the case of coincidence of values of the Method name parameter for different configuration methods of the Adapter.

source: Имя метода — в случае если параметр Имя метода в Loginom Adapter не задан, значение параметра используется в качестве составной части имен(name) элементов и атрибутов WSDL-описания веб-сервиса Адаптера.
en: Method name — if the Method name in Loginom Adapter parameter is not specified, the parameter value is used as a part of the names (name) of items and attributes in the WSDL description of the Adapter web service.

source: Инструкция по активации программного SP-ключа без интернета.
en: Software SP Dongle Activation Manual without Net Access.

source: Инструкция по активации программного SP-ключа.
en: Software SP Dongle Activation Manual.

source: Инструкция по обновлению USB-ключей.
en: USB Dongles Upgrade Manual.

source: Использование локального ключа в персональной версии
en: Local dongle (personal version) usage

source: Использование локального ключа в серверной версии
en: Local dongle (server version) usage

source: Использование сетевого ключа
en: Network dongle usage
